Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_enforcement/crowd_control_at_public_events_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Crowd control at public events in Ireland
ga: Rialú sluaite ag imeachtaí poiblí in Éirinn

source: Every year many concerts, festivals, public meetings and major events take place in Ireland
ga: Gach bliain bíonn go leor ceolchoirmeacha, féilte, cruinnithe poiblí agus imeachtaí móra ar siúl in Éirinn

source: Article 40 of Bunreacht na hEireann (the Irish Constitution) guarantees your right to assemble or meet peacefully and without weapons
ga: Tugann Airteagal 40 de Bhunreacht na hÉireann ráthaíocht go bhfuil sé de cheart agat bailiú le chéile nó bualadh le chéile go síochánta agus gan airm

source: This right is limited by legislation to protect public order and morality
ga: Cuireann reachtaíocht srian leis an gceart seo chun ord poiblí agus moráltacht a chosaint

source: The law as discussed below prevents or controls meetings that are calculated or designed to cause a riot or breach of the peace
ga: Cuireann an dlí a phléitear thíos cosc ar nó rialaíonn sé cruinnithe atá eagraithe nó deartha chun círéib nó briseadh síochána a chúiseamh

source: There is more information about these public order offences here
ga: Tá níos mó faisnéise faoi na cionta oird phoiblí seo ar fáil anseo

source: The purpose of crowd control at public events is to maintain public peace and order and ensure the safety of all who are gathered there
ga: Is é cuspóir an rialaithe sluaite ag imeachtaí poiblí síocháin phoiblí a chothabháil agus sábháilteacht na ndaoine uile atá bailithe ann a chinntiú

source: There are laws in place designed to give the Gardai (Irish police force) clear and comprehensive legal powers to deal with crowd control
ga: Tá dlíthe i bhfeidhm a dearadh chun cumhachtaí dlíthiúla soiléire cuimsitheacha a thabhairt do na Gardaí (fórsa póilíní na hÉireann) chun cur ar a gcumas déileáil le rialú sluaite

source: Part III of the Criminal Justice (Public Order) Act 1994 is the main law on this area and is based on the recommendations of the Hamilton Committee on Public Safety and Crowd Control
ga: Is í Cuid III den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 an dlí príomhúil a bhaineann leis an réimse seo agus tá sé bunaithe ar mholtaí an Choiste Hamilton ar Shábháilteacht Phoiblí agus Rialú Sluaite

source: That committee was established in the wake of the Hillsborough disaster in the UK in 1989
ga: Bunaíodh an coiste sin i ndiaidh thubaiste Hillsborough sa Ríocht Aontaithe i 1989

source: Control of access to certain events
ga: Rialú rochtana ar imeachtaí áirithe

source: Section 21 of the Criminal Justice (Public Order) Act 1994 empowers the Gardai to place barriers on roads up to one mile (1.6 km) from where a particular event is taking place
ga: De réir Alt 21 den Acht um Cheartas Coiriúil (Ord Poiblí) 1994 tá sé de chumhacht ag na Gardaí bacainní a chur ar bhóithre suas le míle amháin (1.6 km) ón áit ina bhfuil imeacht áirithe ar siúl

source: The decision on the placing of barriers must be made by a Garda who is of Superintendent rank or higher
ga: Ní mór do Gharda ar ghrád Ceannfoirt nó níos airde cinneadh a dhéanamh faoi cá háit a gcuirtear bacainní

source: When the barriers are in place the Gardai are allowed to prohibit people from crossing or passing the barrier if the person does not have a ticket for the event
ga: Nuair a chuirtear bacainní ann féadann na Gardaí cosc a chur ar dhaoine an bhacainn a thrasnú nó dul thart uirthi mura bhfuil ticéad ag an duine don imeacht

source: The Garda may also seize any alcohol or disposable drinks containers or any offensive article at the barrier before allowing a person to proceed to the event
ga: Féadann na Gardaí aon alcól nó soithigh dí indiúscartha nó aon ábhar ionsaithe a thógáil ag an mbacainn sula dtugann siad cead do dhuine dul ar aghaidh chuig an imeacht

source: Section 21 also allows people to pass the barriers if they are going to their home or place of work
ga: De réir Alt 21 tá cead ag daoine dul thar na bacainní má tá siad ag dul abhaile nó go dtí an áit an n-oibríonn siad ann

source: They may also pass the barriers if they are going to any place in the area of the event if it is for a lawful purpose
ga: Féadann siad dul thar na bacainní freisin má tá siad ag dul chuig aon áit i gceantar na himeachta agus tá cuspóir dleathach leis

source: Anyone who fails to obey the direction given by a Garda at a barrier will be guilty of an offence and is liable to a class D fine
ga: Beidh aon duine nach gcomhlíonann treoir tugtha ag Garda ag bacainn ciontach i gcion agus dlífear fíneáil aicme D a chur air/uirthi

source: Surrender and seizure of intoxicating liquor
ga: Tabhairt suas agus gabháil deochanna meisciúla

source: There are rules in Ireland regarding the serving and sale of alcohol
ga: Tá rialacha in Éirinn maidir le seirbheáil agus díol an alcóil

source: These rules are set out in the various Intoxicating Liquor Acts
ga: Tá na rialacha seo leagtha amach sna hAchtanna Deochanna Meisciúla éagsúla

source: There is more about the law on alcohol in Ireland here
ga: Tá níos mó faoin dlí maidir le halcól in Éirinn anseo

source: The Criminal Justice (Public Order) Act 1994 also gives the Gardai the power to search a person going to an event where a barrier has been erected
ga: De réir an Achta um Cheartas Coiriúil (Ord Poiblí) 1994, tá sé de chumhacht ag na Gardaí freisin duine atá ag dul chuig imeacht a raibh bacainn curtha suas dó a chuardach

source: These rights are set out in Section 22 of the 1994 Act and allow the Gardai to seize intoxicating liquor or any disposable container or any other article which could be used to cause injury
ga: Leagtar na cearta sin amach in Alt 22 d'Acht 1994 agus tugann sé cead do na Gardaí deoch meisciúil nó aon soitheach indiúscartha nó aon ábhar eile a d'fhéadfaí a úsáid chun gortú a chúiseamh a ghabháil

source: This law also allows a Garda to refuse to allow someone to proceed to the event where they refuse to surrender or give up the intoxicating liquor, disposable container or other article concerned
ga: Tugann an dlí seo cead do Gharda diúltú le duine dul ar aghaidh chuig an imeacht má dhiúltaíonn siad deoch meisciúil, soitheach indiúscartha nó an t-ábhar eile i gceist a thabhairt suas

source: The Gardai may also require that you to leave the area in an orderly and peaceful manner
ga: Féadann na Gardaí éileamh ort freisin an ceantar a fhágáil ar bhealach ordúil agus síochánta

source: If you fail to comply with such a request by the Garda without lawful authority or reasonable excuse then you will be guilty of an offence
ga: Má mhainníonn tú éileamh dá leithéid ó Gharda a chomhlíonadh gan údarás dleathach nó leithscéal réasúnta, ansin tá tú ciontach i gcion

source: The fine for this offence is a class D fine
ga: Is í an fhíneáil don chion seo fíneáil aicme D
